---
type: AnalyticalModelSelector
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 5
tags: [revit-api, class]
---

# AnalyticalModelSelector

`Autodesk.Revit.DB.Structure.AnalyticalModelSelector` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AnalyticalModelSelector | — | `` |
| Constructor | AnalyticalModelSelector | 2011 | `public AnalyticalModelSelector ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | CurveSelector | 2011 | `public AnalyticalCurveSelector CurveSelector { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |